
&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если Операция = "+" Тогда
		
		Результат = ПервыйОператор + ВторойОператор;
		
	ИначеЕсли Операция = "-" Тогда
		
		Результат = ПервыйОператор - ВторойОператор;
		
	ИначеЕсли Операция = "*" Тогда
		
		Результат = ПервыйОператор * ВторойОператор;
		
	ИначеЕсли Операция = "/" Тогда
		
		Если ВторойОператор = 0 Тогда
			
			Результат = "Делить на 0 нельзя!";
			
			Возврат;
			
		КонецЕсли;
		
		Результат = Окр(ПервыйОператор / ВторойОператор, 5, РежимОкругления.Окр15как20);
		
	Иначе
		
		Результат = "Неизвестный оператор";
		
	КонецЕсли;
	
	
КонецПроцедуры
